# Interpolation

This is a technique where we fill any value if that are missing in its sequence means age column there 20,21,22,_,24,_,26,27

here missing two value so through interpolation we can fill the estimate value on the base of rest data in column
## Note:
    Mostly this method use when we are dealing with time series data like stockmarket , trading, numeric data with trends, we can't apply this method with nominal data or attributes etc

In [1]:
import pandas as pd;

In [5]:
data={
    "name":["shahid","basit","king","kumail","askari","basit","shukoor","kazim","muhammad","sakina","khatija","kubra"],
    "age":[23,24,25,20,None,23,46,78,64,30,26,28],
    "salary":[3873,9472,None,2890,4232,3211,2222,4562,1234,3421,1235,7632],
    "performance Score":[85,23,45,None,14,45,67,78,90,33,66,88],

}
df=pd.DataFrame(data)
df.describe()

             age       salary  performance Score
count  11.000000    11.000000          11.000000
mean   35.181818  3998.545455          57.636364
std    19.234439  2533.122751          27.056507
min    20.000000  1234.000000          14.000000
25%    23.500000  2556.000000          39.000000
50%    26.000000  3421.000000          66.000000
75%    38.000000  4397.000000          81.500000
max    78.000000  9472.000000          90.000000

### Now Interpolation method

In [ ]:
df.interpolate(method="linear",axis=0,inplace=True)
df

# Sorting and Aggregation

### Sorting

In [ ]:
# Sorting data in 1 column trhough sort_values()
df.sort_values(by="age",ascending=False,inplace=True) # ascending=false/true
print("Sorted data by ascending: \n") 
df

In [ ]:
# Sorting data with multiple column

df.sort_values(by=['age','salary'],ascending=[True,False],inplace=True)
print("Sorting data on the base of multiple column:\n")
df

### Aggregation

the following are the aggregation methods like mean(),median(),mode(),sum(),max(), min(),count(),std(),var()

In [ ]:
avgSalary=df['salary'].mean()

print("Average Salary:",avgSalary)

# group on the base of single column
groupVise=df.groupby("age")["salary"].sum()
print("Group vise:\n ",groupVise)


 # group on the base of multiple column
multGrp=df.groupby(["age","name"])['salary'].sum()
print("MultGrp:\n",multGrp)

# Merge and join

In [ ]:
df_customer=pd.DataFrame({
    "id":[1,2,3],
     "name":["basit","muhammad","Ali"]
})


df_orders=pd.DataFrame({
    "id":[1,2,4],
    "orderAmount":[300,200,540]
})

In [ ]:
df_merged=pd.merge(df_customer,df_orders,on="id",how="right")
print("Merge data trough right side:\n",df_merged)
df_merged=pd.merge(df_customer,df_orders,on="id",how="left")
print("Merge data trough left side :\n",df_merged)
df_merged=pd.merge(df_customer,df_orders,on="id",how="inner")
print("Merge data trough inner side:\n",df_merged)
df_merged=pd.merge(df_customer,df_orders,on="id",how="outer")
print("Merge data trough outer side:\n",df_merged)
# df_merged=pd.merge(df_customer,df_orders,on="id",how="cross") # cross give the cartisan product of two df
# print("Merge data trough cross side:\n",df_merged)

In [24]:
concate=pd.concat([df_customer,df_orders],axis=0,ignore_index=True)
print("Concatinate: \n",concate)

Concatinate:
    id      name  orderAmount
0   1     basit          NaN
1   2  muhammad          NaN
2   3       Ali          NaN
3   1       NaN        300.0
4   2       NaN        200.0
5   4       NaN        540.0